content/posts/choose-fonts-for-web.org
#+TITLE: 如何为网站选择字体
#+DATE: <2022-02-10 Thu>
#+TAGS[]: 技术

** 中文
   :PROPERTIES:
   :CUSTOM_ID: 中文
   :END:

- Noto Serif Simplified Chinese
- Noto Sans Simplified Chinese
- WenQuanYi Micro Hei

** 英文
   :PROPERTIES:
   :CUSTOM_ID: 英文
   :END:

[[https://ridiqulous.com/chinese-webfont-guide/]]
[[https://jacobruan.com/the-font-selection-and-development-guide-in-chinese-web-pages/]]
[[https://blog.mutoo.im/2020/02/fonts-for-my-blog-theme/]]
[[https://en.wikipedia.org/wiki/List_of_CJK_fonts]]
[[https://www.runoob.com/w3cnote/web-font-family.html]]
[[https://www.ruanyifeng.com/blog/2014/07/chinese_fonts.html]]
