blog/2021/choose-fonts-for-web.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-08 Tue 12:00 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>如何为网站选择字体</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">如何为网站选择字体</h1>
</header>
<div id="outline-container-org05d5329" class="outline-2">
<h2 id="org05d5329">中文</h2>
<div class="outline-text-2" id="text-org05d5329">
<ul class="org-ul">
<li>Noto Serif Simplified Chinese</li>
<li>Noto Sans Simplified Chinese</li>
<li>WenQuanYi Micro Hei</li>
</ul>
</div>
</div>

<div id="outline-container-org0a45513" class="outline-2">
<h2 id="org0a45513">英文</h2>
<div class="outline-text-2" id="text-org0a45513">
<p>
<a href="https://ridiqulous.com/chinese-webfont-guide/">https://ridiqulous.com/chinese-webfont-guide/</a>
<a href="https://jacobruan.com/the-font-selection-and-development-guide-in-chinese-web-pages/">https://jacobruan.com/the-font-selection-and-development-guide-in-chinese-web-pages/</a>
<a href="https://blog.mutoo.im/2020/02/fonts-for-my-blog-theme/">https://blog.mutoo.im/2020/02/fonts-for-my-blog-theme/</a>
<a href="https://en.wikipedia.org/wiki/List_of_CJK_fonts">https://en.wikipedia.org/wiki/List_of_CJK_fonts</a>
<a href="https://www.runoob.com/w3cnote/web-font-family.html">https://www.runoob.com/w3cnote/web-font-family.html</a>
<a href="https://www.ruanyifeng.com/blog/2014/07/chinese_fonts.html">https://www.ruanyifeng.com/blog/2014/07/chinese_fonts.html</a></p>
</div>
</div>
</div>
</body>
</html>